doc: 完成方案设计
